[
  {
    "bookId": "1",
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://images.pexels.com/photos/14488930/pexels-photo-14488930.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "review": "A timeless epic fantasy that explores themes of good versus evil, friendship, and courage. Set in the richly imagined world of Middle-earth, this trilogy follows Frodo Baggins and his companions on a perilous quest to destroy the One Ring. The journey is fraught with danger, sacrifice, and moments of hope, all woven into a narrative that has captivated readers for generations.",
    "totalPages": 1137,
    "rating": 4.2,
    "category": "Fantasy",
    "tags": ["Epic", "Adventure", "Mythology"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1954
  },
  {
    "bookId": "2",
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://icon2.cleanpng.com/20180914/xiu/kisspng-to-kill-a-mockingbird-jem-finch-atticus-finch-go-s-1713940629121.webp",
    "review": "A powerful and poignant tale of racial injustice and human compassion set in the Deep South. Told through the eyes of Scout Finch, a young girl, the novel explores her father Atticus Finch's fight for justice as he defends a black man falsely accused of a crime. Harper Lee’s enduring masterpiece teaches timeless lessons about morality, empathy, and the complexities of human nature.",
    "totalPages": 304,
    "rating": 4.3,
    "category": "Classic",
    "tags": ["Social Justice", "Southern Gothic"],
    "publisher": "J.B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": "3",
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://banner2.cleanpng.com/20180802/ife/kisspng-self-help-book-shelf-product-5b62b521a9e659.2688852915331955536959.jpg",
    "review": "A gripping and thought-provoking dystopian novel that delves into themes of totalitarianism, surveillance, and the erosion of individual freedoms. Set in a world where truth is manipulated and Big Brother watches every move, protagonist Winston Smith dares to seek truth and freedom, facing dire consequences. Orwell's masterpiece serves as a timeless warning about the dangers of unchecked power and propaganda.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Science Fiction",
    "tags": ["Dystopian", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": "4",
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://icon2.cleanpng.com/20180528/lyu/kisspng-pride-and-prejudice-the-story-grid-edition-brand-cover-book-5b0be7741039e8.9718562815275068040665.jpg",
    "review": "A delightful romantic novel that examines love, marriage, and societal expectations in Regency-era England. Elizabeth Bennet, with her sharp wit and strong sense of independence, navigates a world where first impressions often mislead. Her evolving relationship with the enigmatic Mr. Darcy showcases Jane Austen's keen insight into human nature and social dynamics. This timeless classic remains beloved for its humor, charm, and universal appeal.",
    "totalPages": 279,
    "rating": 4.2,
    "category": "Romance",
    "tags": ["Classic", "Romantic Comedy"],
    "publisher": "T. Egerton",
    "yearOfPublishing": 1813
  },
  {
    "bookId": "5",
    "bookName": "The Hitchhiker's Guide to the Galaxy",
    "author": "Douglas Adams",
    "image": "https://icon2.cleanpng.com/20180531/foq/avpaxolsl.webp",
    "review": "A hilariously absurd and wildly imaginative science fiction adventure that begins with the destruction of Earth. Arthur Dent, an unwitting human, is swept into a bizarre journey across the galaxy, accompanied by quirky characters and guided by a trusty (and humorous) electronic guidebook. Douglas Adams' blend of wit, satire, and sheer creativity makes this a must-read for sci-fi and comedy lovers alike.",
    "totalPages": 224,
    "rating": 4.8,
    "category": "Science Fiction",
    "tags": ["Humor", "Sci-Fi", "Adventure"],
    "publisher": "Pan Books",
    "yearOfPublishing": 1979
  },
  {
    "bookId": "6",
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.postimg.cc/j2w7mpyL/18144590.jpg",
    "review": "A captivating tale of self-discovery and spiritual awakening. Santiago, a shepherd boy, embarks on a journey to find a treasure he has seen in his dreams, encountering wise mentors, challenges, and revelations along the way. Paulo Coelho's inspiring novel reminds readers to listen to their hearts, follow their dreams, and embrace the journey as much as the destination.",
    "totalPages": 197,
    "rating": 4.4,
    "category": "Inspirational",
    "tags": ["Philosophy", "Self-Discovery", "Adventure"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": "7",
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://icon2.cleanpng.com/20180401/cbw/avcbsu1zq.webp",
    "review": "A mesmerizing portrait of the Roaring Twenties and a poignant critique of the American Dream. Through the eyes of Nick Carraway, readers witness the extravagant life and tragic downfall of Jay Gatsby, a man driven by unrelenting love and ambition. Fitzgerald's lyrical prose and deep exploration of wealth, class, and unfulfilled dreams make this an enduring literary classic.",
    "totalPages": 180,
    "rating": 4.3,
    "category": "Classic",
    "tags": ["Social Commentary", "Tragedy"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": "8",
    "bookName": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.postimg.cc/GpXT2LQ4/42844155.jpg",
    "review": "The magical journey begins in this enchanting tale of a young boy named Harry Potter, who discovers he is a wizard on his eleventh birthday. Transported to the magical world of Hogwarts, Harry makes friends, faces enemies, and uncovers the truth about his parents' tragic past. J.K. Rowling's imaginative storytelling introduces a world filled with wonder, danger, and unforgettable characters.",
    "totalPages": 309,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Magic", "Adventure"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "bookId": "9",
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.postimg.cc/gjZxNvPh/kisspng-the-hobbit-the-lord-of-the-rings-paperback-the-fel-tolkien-reading-day-5b4a46fb1578a5-623618.jpg",
    "review": "A captivating fantasy adventure that follows Bilbo Baggins, a reluctant hero, as he joins a group of dwarves on a quest to reclaim their homeland. Along the way, Bilbo encounters trolls, goblins, and a dragon, as well as the mysterious One Ring. Tolkien's enchanting storytelling and vivid world-building make this a beloved classic for readers of all ages.",
    "totalPages": 310,
    "rating": 4.7,
    "category": "Fantasy",
    "tags": ["Adventure", "Mythology"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": "10",
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.postimg.cc/5t4sHShn/5107.jpg",
    "review": "A deeply introspective and thought-provoking coming-of-age novel. Holden Caulfield, a disillusioned teenager, shares his experiences and reflections as he grapples with alienation, loss, and the complexities of growing up. Salinger's honest and raw portrayal of youth resonates with readers as a timeless exploration of identity and the search for meaning.",
    "totalPages": 224,
    "rating": 4.0,
    "category": "Classic",
    "tags": ["Existentialism", "Social Commentary"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  }
]
